# constants.py
import textwrap

# 기본 메시지
BASE = """\
안녕하세요! 더 나은 삶을 위한 **스마트도시**, 용인시청 챗봇입니다.  

저는 **홈페이지 기반 구정 정보, 주요 행사 등**을 실시간 안내해 드리고 있어요.  

📢 *인공지능 AI(ChatGPT)의 특성상 일부 부정확한 답변이 포함될 수 있습니다.  
참고용으로만 이용하시고, 중요하거나 자세한 사항은 반드시 홈페이지([yongin.go.kr](https://yongin.go.kr)) 및 담당 부서를 통해 확인해 주세요.*

📌 TIP! 이렇게 질문해 보세요!


  - 대형 생활폐기물 어떻게 버려?
  - 여권발급 필요서류 및 발급기간은?
  - 용인시청은 어떻게 갈 수 있어?
  - 무인 민원 발급 방법은?
  - 전봇대가 무너졌어. 어디에 연락해야돼?
"""

# 조직도 메시지
CONTACT = """\
안녕하세요! 더 나은 삶을 위한 **스마트도시**, 용인시청 챗봇입니다.  

저는 **조직도 정보**를 실시간 안내해 드리고 있어요.  

📌 TIP! 이렇게 질문해 보세요!


  - 민원 담당자 연락처 알려줘
  - 청년 월세지원담당자 연락처 알려줘
  - 법무 관련 담당자 정보
  - 정책기획 관련 담당자 정보
"""

GREETING_MESSAGE = {"base": textwrap.dedent(BASE), "contact": textwrap.dedent(CONTACT)}
